site.org
#+STARTUP: content
#+AUTHOR: benford
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t
** DONE Principles
CLOSED: [2019-02-03 Sun 19:38]
:PROPERTIES:
:EXPORT_FILE_NAME: principle
:EXPORT_HUGO_HEADLESS: t
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2019-02-03 Sun 19:38]
:END:

# {{% blockquote title="Principle" source="Google Dictionary" %}}
# /ˈprɪnsɪp(ə)l/
# noun
# 1. a fundamental truth or proposition that serves as the foundation for a system
#    of belief or behaviour or for a chain of reasoning. "the basic principles of
#    justice"
# 2. a general scientific theorem or law that has numerous special applications
#    across a wide field.

# synonyms:	truth, proposition, concept, idea, theory, postulate; More
# {{% /blockquote %}}
Over my decade plus career in software development, I've experienced the feeling
of being in teams using the wrong processes and not adapting to their realities
fast enough. This includes everything from start ups where I was the first
programmer on board, to building teams in global mega banks.

About 4 years ago my brain basically short circuited itself and banned me from
learning more tech stuff until I figured out how to make the point at which the
rubber meets the road work better: *People and teams*.

As I researched more and began to understand what makes a great development
team, I started to recognise the underlying principles. They were things I had
already learned, and in fact deeply ingrained, but not recognised when I was a
*Royal Marine* in the early 2000s.


Having this moment of recognition was a breakthrough, because it showed me that
once you are able to translate something from one domain to another and keep the
essence of why it works, you have your hands on a fundamental principle. This is
nothing new. The famous swordsman Myamoto Musashi knew this way back in the
1600s, as the quote above shows.

So what if you could understand a *SINGLE PRINCIPLE* and from that drive the
evolution of your organisation's operating system?

{{% emphasis %}}This is what I want to show you.{{% /emphasis %}}

The single principle that's you must understand to achieve the *operational
excellence* that every business needs to *thrive* and *scale*.

The single principle that unites the 3 pillars of *PURPOSE* *PEOPLE* and *PRACTICES*

<<purpose>>
