content/home/principle.md
+++
title = "Principles"
author = ["Ben Ford"]
date = 2019-02-03T19:38:00+00:00
lastmod = 2019-05-04T09:57:25+01:00
draft = false
headless = true
weight = 1
+++

Over my decade plus career in software development, I've experienced the feeling
of being in teams using the wrong processes and not adapting to their realities
fast enough. This includes everything from start ups where I was the first
programmer on board, to building teams in global mega banks.

About 4 years ago my brain basically short circuited itself and banned me from
learning more tech stuff until I figured out how to make the point at which the
rubber meets the road work better: **People and teams**.

As I researched more and began to understand what makes a great development
team, I started to recognise the underlying principles. They were things I had
already learned, and in fact deeply ingrained, but not recognised when I was a
**Royal Marine** in the early 2000s.

Having this moment of recognition was a breakthrough, because it showed me that
once you are able to translate something from one domain to another and keep the
essence of why it works, you have your hands on a fundamental principle. This is
nothing new. The famous swordsman Myamoto Musashi knew this way back in the
1600s, as the quote above shows.

So what if you could understand a **SINGLE PRINCIPLE** and from that drive the
evolution of your organisation's operating system?

{{% emphasis %}}This is what I want to show you.{{% /emphasis %}}

The single principle that's you must understand to achieve the **operational
excellence** that every business needs to **thrive** and **scale**.

The single principle that unites the 3 pillars of **PURPOSE** **PEOPLE** and **PRACTICES**

<a id="orgf097ba0"></a>
